In [39]:
import pandas as pd
import pyodbc

In [40]:
conn_str = 'DRIVER={ODBC Driver 17 for SQL Server};\
            SERVER=MSI\DUCNAM;\
            DATABASE=my_database;\
            UID=dn;\
            PWD=123456'

In [41]:
conn = pyodbc.connect(conn_str)

In [42]:
# Add data to DataFrame
new_data = {'StudentID':[15,16,17,18],
            'fname':['Dinh Le Duc Nam', 'Le Thuy Huyen','Tran Binh Nguyen','Nguyen Minh Duc'],
            'sex':[1,1,1,0],
            'dob':['2003-10-18','2003-2-3','2003-10-19','2003-10-10']}
new_df = pd.DataFrame(new_data)
new_df

   StudentID             fname  sex         dob
0         15   Dinh Le Duc Nam    1  2003-10-18
1         16     Le Thuy Huyen    1    2003-2-3
2         17  Tran Binh Nguyen    1  2003-10-19
3         18   Nguyen Minh Duc    0  2003-10-10

In [43]:

cursor = conn.cursor()

for index, row in new_df.iterrows():
    values = (row['StudentID'], row['fname'],row['sex'],row['dob'])
    cursor.execute("INSERT INTO TblStudent (StudentID,fname,sex,dob) VALUES (?,?,?,?)", values)
    conn.commit()

In [44]:
# Update and Delete
    
cursor.execute("Delete TblStudent\
                where StudentID >= 15")
cursor.execute("Update TblStudent\
                Set fname = 'Thuy Huyen'\
                where StudentID = 11")
cursor.commit()

In [45]:


updated_df = pd.read_sql("SELECT * FROM TblStudent", conn)
print(updated_df)

    StudentID       fname    sex        dob
0           1      DucNam   True 2000-01-01
1           2       Sarah   True 2001-05-10
2           3     Michael   True 2002-03-15
3           4       Emily   True 2003-07-20
4           5       David  False 2004-09-25
5           6     Jessica   True 2005-11-30
6           7      Daniel  False 2006-02-05
7           8      Olivia   True 2007-04-10
8           9     Matthew   True 2008-06-15
9          10      Sophia   True 2009-08-20
10         11  Thuy Huyen  False 2004-09-25
11         12  Minh Trinh  False 2003-10-01
12         13    Dung Dam   True 2003-03-29

C:\Users\FPT SHOP\AppData\Local\Temp\ipykernel_23424\1675294783.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  updated_df = pd.read_sql("SELECT * FROM TblStudent", conn)

In [46]:
query = 'Select * From TblStudent'
conn = pyodbc.connect(conn_str)
df = pd.read_sql(query,conn)
print(df)

    StudentID       fname    sex        dob
0           1      DucNam   True 2000-01-01
1           2       Sarah   True 2001-05-10
2           3     Michael   True 2002-03-15
3           4       Emily   True 2003-07-20
4           5       David  False 2004-09-25
5           6     Jessica   True 2005-11-30
6           7      Daniel  False 2006-02-05
7           8      Olivia   True 2007-04-10
8           9     Matthew   True 2008-06-15
9          10      Sophia   True 2009-08-20
10         11  Thuy Huyen  False 2004-09-25
11         12  Minh Trinh  False 2003-10-01
12         13    Dung Dam   True 2003-03-29

C:\Users\FPT SHOP\AppData\Local\Temp\ipykernel_23424\2379897551.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query,conn)

In [47]:
conn.close()